notes/Objective C.html
---
layout: notes
---
<nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Learn C</a></li>
<li><a href="#sec-2">2. gcc</a></li>
<li><a href="#sec-3">3. <code>NSLog</code></a></li>
<li><a href="#sec-4">4. Classes</a>
<ul>
<li><a href="#sec-4-1">4.1. calling class or instance methods</a></li>
<li><a href="#sec-4-2">4.2. @interface</a></li>
<li><a href="#sec-4-3">4.3. @implementation</a></li>
<li><a href="#sec-4-4">4.4. <code>- (void) methodName: (int)n;</code></a></li>
<li><a href="#sec-4-5">4.5. synthesized accessor methods</a></li>
<li><a href="#sec-4-6">4.6. dot</a></li>
<li><a href="#sec-4-7">4.7. <code>@class</code></a></li>
</ul>
</li>
<li><a href="#sec-5">5. inheritance</a></li>
<li><a href="#sec-6">6. <code>id</code></a></li>
<li><a href="#sec-7">7. instropection</a></li>
<li><a href="#sec-8">8. Selectors</a></li>
<li><a href="#sec-9">9. try &amp; catch</a></li>
<li><a href="#sec-10">10. auto</a></li>
<li><a href="#sec-11">11. volatile</a></li>
<li><a href="#sec-12">12. <code>enum</code></a></li>
<li><a href="#sec-13">13. categories</a></li>
<li><a href="#sec-14">14. protocols</a></li>
<li><a href="#sec-15">15. compound literal</a></li>
</ul>
</div>
</nav>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Learn C</h2>
<div class="outline-text-2" id="text-1">
<p>
Objective comes on top of C. So if you want to be really good at
Objective C, learn C before hand.
In those notes I focus on Objective C.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> gcc</h2>
<div class="outline-text-2" id="text-2">
<p>
You can use gcc to compile and link your program
</p>

<div class="org-src-container">

<pre class="src src-sh">gcc -framework Foundation files -o progname
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> <code>NSLog</code></h2>
<div class="outline-text-2" id="text-3">
<p>
First argument is the character string to be displayed.
</p>

<div class="org-src-container">

<pre class="src src-C">NSLog(@<span class="org-string">"the sum of %i and %i is %i"</span>, value1, value2, sum);
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Classes</h2>
<div class="outline-text-2" id="text-4">
<p>
<code>[MyClass alloc] init]</code>
<code>[MyClass new]</code>
</p>

<p>
and once you are done
</p>

<p>
<code>[MyClass release];</code>
</p>
</div>

<div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> calling class or instance methods</h3>
<div class="outline-text-3" id="text-4-1">
<div class="org-src-container">

<pre class="src src-C">[ClassOrInstance method];

<span class="org-comment-delimiter">//</span><span class="org-comment">Another way to look at it</span>
[receiver message];
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> @interface</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Describes the class, its data components and methods
</p>
<div class="org-src-container">

<pre class="src src-C">@interface NewClassName: ParentClassName
{
  <span class="org-type">int</span> <span class="org-variable-name">member</span>;
  <span class="org-type">int</span> <span class="org-variable-name">another_member</span>;
}

-(<span class="org-type">void</span>) method1;
+(<span class="org-type">int</span>) method2;
@end
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> @implementation</h3>
<div class="outline-text-3" id="text-4-3">
<p>
Contain code that implements the class and instance methods.
</p>
</div>
</div>

<div id="outline-container-sec-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> <code>- (void) methodName: (int)n;</code></h3>
<div class="outline-text-3" id="text-4-4">
<p>
<code>-</code> is the method type. <code>-</code> is for instance methods, <code>+</code> indicates
a class method.
<code>(void)</code> is the return type. If you don't specify a return type,
<code>id</code> is the default.
</p>
</div>
</div>

<div id="outline-container-sec-4-5" class="outline-3">
<h3 id="sec-4-5"><span class="section-number-3">4.5</span> synthesized accessor methods</h3>
<div class="outline-text-3" id="text-4-5">
<p>
Automatic <i>get</i> and <i>set</i>.
Add <code>@property</code> to your class interface and <code>@synthetize</code> in your
implementation.
</p>

<div class="org-src-container">

<pre class="src src-C">@interface MyClass : NSObject
{
  <span class="org-type">int</span> <span class="org-variable-name">member</span>;
  <span class="org-type">int</span> <span class="org-variable-name">another_member</span>;
}

@property <span class="org-type">int</span> member, another_member;

@end

@implementation

@synthesize member, another_member;

@end
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4-6" class="outline-3">
<h3 id="sec-4-6"><span class="section-number-3">4.6</span> dot</h3>
<div class="outline-text-3" id="text-4-6">
<p>
As of Objective-C 2.0 you can access properties using the dot
operator.
</p>

<div class="org-src-container">

<pre class="src src-C">[myInstance property]
myInstance.property
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4-7" class="outline-3">
<h3 id="sec-4-7"><span class="section-number-3">4.7</span> <code>@class</code></h3>
<div class="outline-text-3" id="text-4-7">
<p>
You can either <code>#import</code> an header file or use <code>@class MyClass</code>.
<code>@class</code> is more efficient because the compiler does not need to
process the entire header file.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> inheritance</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">

<pre class="src src-C">@interface Child: Parent

@end
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> <code>id</code></h2>
<div class="outline-text-2" id="text-6">
<p>
<code>id</code> is a data type used to store an object of any type. In a sense,
it is a generic object type.
</p>

<p>
We don't declare all objects as <code>id</code> because static typing allows
the compiler to check for errors. And it is better to get errors
during the compilation time than during execution time.
</p>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> instropection</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li><code>isKindOfClass</code>
</li>
<li><code>isMemberOfClass</code>
</li>
<li><code>respondsToSelector</code>
</li>
<li><code>isSubclassofClass</code>
</li>
<li><code>performSelector</code>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Selectors</h2>
<div class="outline-text-2" id="text-8">
<div class="org-src-container">

<pre class="src src-C">@selector (alloc)
</pre>
</div>

<p>
Produces a value of type <code>SEL</code> the method named <code>alloc</code>
</p>
</div>
</div>

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> try &amp; catch</h2>
<div class="outline-text-2" id="text-9">
<div class="org-src-container">

<pre class="src src-C">@try {

}
@catch (NSException *exception){

}
</pre>
</div>

<p>
There is also a <code>@finally</code> block. It executes whether or not a
statement in a <code>@try</code> throws an exception.
</p>

<p>
You can <code>@throw</code> you own exception. Inside a <code>@catch</code>, <code>@throw;</code>
throw the same exception that took you into the block.
</p>
</div>
</div>

<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> auto</h2>
<div class="outline-text-2" id="text-10">
<p>
To declare an automatic local variable as opposed to a static one.
It is the default for a variable.
</p>
</div>
</div>

<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> volatile</h2>
<div class="outline-text-2" id="text-11">
<p>
Inverse to <code>const</code> (sort of). Tells the compiler that the specified
variable will change its value. Prevent the compiler from optimizing
redundant assignments to a variable.
</p>
</div>
</div>

<div id="outline-container-sec-12" class="outline-2">
<h2 id="sec-12"><span class="section-number-2">12</span> <code>enum</code></h2>
<div class="outline-text-2" id="text-12">
<div class="org-src-container">

<pre class="src src-C"><span class="org-comment-delimiter">// </span><span class="org-comment">up = 0, down = 1, left = 10, right = left + 1 = 11</span>
<span class="org-keyword">enum</span> <span class="org-type">direction</span> { <span class="org-variable-name">up</span>, <span class="org-variable-name">down</span>, <span class="org-variable-name">left</span> = 10, <span class="org-variable-name">right</span>};
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-13" class="outline-2">
<h2 id="sec-13"><span class="section-number-2">13</span> categories</h2>
<div class="outline-text-2" id="text-13">
<p>
Provides a way to modularize the definition of a class into groups
or categories.
</p>

<div class="org-src-container">

<pre class="src src-C">@interface MyClass (MyCategory)
@end

@implementation MyClass (MyCategory)
@end
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-14" class="outline-2">
<h2 id="sec-14"><span class="section-number-2">14</span> protocols</h2>
<div class="outline-text-2" id="text-14">
<p>
A protocol is a list of methods that is shared among classes.
</p>

<div class="org-src-container">

<pre class="src src-C">@interface MyClass: NSObject &lt;NSCopying, NSCoding&gt;
</pre>
</div>

<p>
And you need to implement the methods to conform to the protocol
</p>

<p>
Here <code>Drawing</code> protocol requires you to implement <code>paint</code> in your
classes. <code>outline</code> can be implemented too but it is optional.
</p>

<div class="org-src-container">

<pre class="src src-C">@protocol Drawing
-(<span class="org-type">void</span>) paint;
@optional
-(<span class="org-type">void</span>) outline;
@end
</pre>
</div>


<p>
You help the compiler to check for compliance of <code>id</code> variables and
protocols.
</p>

<div class="org-src-container">

<pre class="src src-C">id &lt;Drawing&gt; currentObject;
</pre>
</div>


<p>
An <i>informal protocol</i> is really a category that lists a group of methods but
does not implement them. They can also be referred as <i>abstract</i>
protocols.
</p>
</div>
</div>

<div id="outline-container-sec-15" class="outline-2">
<h2 id="sec-15"><span class="section-number-2">15</span> compound literal</h2>
<div class="outline-text-2" id="text-15">
<p>
A <i>compound literal</i> is a type name enclosed in parentheses followed
by an initialization list.
</p>

<div class="org-src-container">

<pre class="src src-C">(<span class="org-keyword">struct</span> <span class="org-type">date</span>) { .month = 7, .day =2, .year = 2004 };
<span class="org-type">int</span> <span class="org-variable-name">intPtr</span> *;
intPrt = (<span class="org-type">int</span> [100]) {[0] = 1, [50] = 50, [99] = 99 };
</pre>
</div>
</div>
</div>
